[{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "r-t7IiTSD0QZdt8lOUCqeQ", "review_id": "0ESSqLfOae77muWTv_zUqA", "stars": 3, "date": "2011-02-11", "text": "Lately i have been feeling homesick for asian food and been hitting up places that i haven't been to in awhile.  Recently re-visited Thai Pan for a quick lunch and quickly ordered without spending too much time perusing the menu.  It looked more diverse than I remembered including some Vietnamese additions.  I remembered the curries and stir-fry dishes were ok but nothing really memorable.  A quick summary for my latest visit:\n\nPros:\n- convenient order-at-the counter setup\n- self-serve drink station\n- brown and white rice mixture\n- friendly and gracious owners\n\nCons:\n- too much napa cabbage in comparison to green vegetables \n- wish the owner/chef would be back in the kitchen vs. managing\n- spice level on the weak side", "type": "review", "business_id": "WIcDFpHEnC3ihNmS7-6-ZA"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SS85hfTApRnbTPcJadra8A", "review_id": "VyAKIaj_Rmsf_ZCHcGJyUw", "stars": 5, "date": "2010-05-30", "text": "I love Marilo!  She understands my hair type and knows exactly what to do with my hair.  She keeps a record of my previous visits.  She recommends what is best for my hair.  She is pleasant to work with: easygoing, friendly, and respectful.  I've been going to her since 2008.  I'm really picky with hair people, and I used to go back to Chicago for haircuts.  Now, I stick to Marilo.", "type": "review", "business_id": "70p94Ejeu1v5XlIkbKORYQ"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xAVu2pZ6nIvkdHh8vGs84Q", "review_id": "DusrkpkTGPGkqK13xO1TZg", "stars": 3, "date": "2011-11-26", "text": "Standard Chipotle fare - consistently good; not bad for corporate food - if you have a few minutes, there are a number of good local offerings within walking distance.", "type": "review", "business_id": "WcGTSRku3mrVK7V9GKq4UQ"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xuvj2Fq6c3mCmplVG7h21w", "review_id": "A5FL-YYXnr2hnvXQbgkkrQ", "stars": 4, "date": "2013-10-10", "text": "Very good prices with quality ingredients.", "type": "review", "business_id": "6P76zWJBtahmJa0yqd9j4A"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jHH_UDpCnF-YTnveyoMTIA", "review_id": "SzhIWfzLHUZfiAaVTtKHxw", "stars": 1, "date": "2012-09-02", "text": "I went to this Petco a few times and was a bit appalled at their rodents section, to be perfectly honest. Granted, it wasn't as bad as it could have been, but in my opinion, it was unacceptable.\n\nFor one thing, there was six or seven rats packed in one cage that was, what . . . \n1' x 9\", 1 x 8\"? Don't quote me on that - I'm not 100% sure, but regardless of the details, it was way too small for the number of rats that were in it. They weren't unhealthy; they didn't look very sick, but they definitely didn't look particularly healthy, either. \n\nThe guinea pigs were what really shocked me, though. If you know anything about guinea pigs, you'll know they need a lot of space - even just for one. This cage was the same size as the rat's cage (they all were). They barely had enough to room to walk, much less exercise or popcorn (which my guinea pigs do often). There were two guinea pigs packed in that thing, when it was way, way too small for one baby guinea pig. It also didn't look that clean - all the cages, in my opinion, were grungy. The whole place felt grungy and grimy. And they obviously weren't cleaning the cages everyday, which they should be doing. It would be more unfair to the animals to do anything but at least a small cleaning each day.\n\nThe prices are, indeed, pretty good, or at least better than the prices at the Petsmart I usually go to, so there's one point for Petco. \n\nAt last, the employees. Are they nice and cheerful? Yes. That is, until you politely point out that the guinea pig cage is way too small for them to be healthy and happy (I was trying my hardest to be polite, although I could have come across as rude), they (or the one I talked to) immediately turn defensive, telling you \"it's very temporary\" and \"we take them out every night\" (which I don't believe, but maybe a Petco employee can correct me on that?) and make a face at you, not once telling you they'll tell their manager (even if they won't) or you may be right, like a good employee would.\n\nWant your customers to come back? Here's a good tip: don't tell them they're wrong about something, and rudely correct them, obviously trying to rush them out. Humor them, even if they are wrong about something.\n\nOverall, I would recommend not shopping here. They don't take good care of their pets, and their employees are rude if you care about the animals when they plainly don't. Good prices? They don't make up for that.\n\nI apologize if I made this too long, and thank you if you read all of this, regardless of whether or not you agree with me.", "type": "review", "business_id": "oqr6xovYM2BRrLojaO26Dg"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b5TgTsk4dv8x2KDZYI-V7w", "review_id": "EaBnd0MGL61KhvFwS3bQvQ", "stars": 4, "date": "2011-05-16", "text": "This is the first unique (not chain) brunch place I have found in the east valley that serves alcohol! The food was DELISH! finally", "type": "review", "business_id": "R1ySBCVS2eQf-s0Z4ifIug"},
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "P1qwZrslRv9KS9vPJNXe4g", "review_id": "Rp1yvabsZ76dNwjG1MMTkA", "stars": 2, "date": "2009-04-16", "text": "Brian S. Sum's it up perfectly with \"if you're going to try to be a Hooters/Library sports bar rip-off, hire more attractive, more in-shape waitresses to wear those cheesy uniforms.\"\n\nThe only reason I give it a second star is because it's so close to home and they're open till 2, so I can't hate totally.", "type": "review", "business_id": "o9nCXNC14VScabiy2bftgw"},
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "rrIMJijS60XTgjRTGBCLcw", "stars": 3, "date": "2008-08-25", "text": "Remember the no-bake cookies of your elementary school cafeteria?! Chocolate, peanut butter and rolled oats in a gooey lump? Uh, yea... you can buy giant ones here for $1.95!! Totally rich; great excuse for a school yard flashback. (Warning: I do NOT advise attempting to eat the whole thing yourself.)\n\nAlso, they have cookies with full sized Resese's peanut butter cups in the middle... yummm...", "type": "review", "business_id": "-8wyZkzfBmCFkMwCGcR4PQ"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cgD3mG3fZkIccOk1R9O2UQ", "review_id": "6z6wOKSFVcZfCdhOPcZY5g", "stars": 5, "date": "2012-01-02", "text": "I love coming to this bar. Friendly bartenders and a beautiful view.", "type": "review", "business_id": "OSlTIcDNSSt_83ciKwT1Xg"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Iqjw_gWq6okooSkmZ9a_1A", "review_id": "zSZ47fXX02XGxTJSQ-vulg", "stars": 5, "date": "2012-04-10", "text": "Great sushi rolls and BYOB!  Very friendly staff.  Three for lunch $25 per person including a generous tip.  Love this place!", "type": "review", "business_id": "h6jfMpTZpNduLG0wE2tbaw"},
{"votes": {"funny": 5, "useful": 4, "cool": 2}, "user_id": "RLmUj1QGMz2dLBcdayuBiw", "review_id": "dE2VhLieetdalviZc28WnA", "stars": 3, "date": "2010-10-03", "text": "I just spent 8 days in Florida.  I have had a total of 2 drinks in the past 8 days.  This kookie tequila bar in the middle of the C terminal in Phoenix is like my mirage in the dessert.  Only when I walked in, it did not disappear.  \n\nI'm two double gin and tonics down, and I have plenty of time before my next flight.  Maybe it's the gin talking, but these are some damned fine nachos.  Damned.  Fine.  And the bartender?  Even finer...though he has me on an auto re-up system with these G&T's, so again, it could be the gin talking.\n\nI would come back here in a heart beat the next time I'm in Phoenix.  Damned.  Fine.", "type": "review", "business_id": "kPh2gPvd8moVx6gNf2iHsA"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DzlIGo5om7KVOG3It2iQlg", "review_id": "8P7RLb7QqJEls-vJpNaQqQ", "stars": 5, "date": "2010-07-25", "text": "The sushi is amazing.  It is made daily in the store by an authentic sushi chef.  The rolls are more beautiful and delictable than in most actual sushi restaurants.  Pricing is good too, 12 piece brown rice spicy tuna for $7.99 beats most happy hour pricing and the really fancy rolls are typically $8-$10.  \n\nThe produce selection is broad as well including an all organic section.\n\nThey also match competitor coupons.  I use the $3 of off $30 from Fresh and Easy when I go there.\n\nThey also have good prices on wine (larger selection than some wine stores)", "type": "review", "business_id": "3gByPjJPMeTi1bKrvdNOdw"},
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "_4lqpCYCqOQzbB6xQGGhrQ", "review_id": "qnpnnZ_JrOLsIdtn5aB9Hw", "stars": 1, "date": "2010-10-14", "text": "Ok, so the grand opening hasn't even happened yet for this place, but sorry Im gonna miss it.  Not...\n\nA group of eight of us show up tonight for \"dinner\" and drinks.  We get seated way the hell in the back.  I guess we didn't fit in with the rest of the crowd.  Two graphic designers, three filmmakers, a photographer and some friends.. ok?  The reason I point this out is that the waiter lets us know that this place isn't that classy of a place like LeBoca, so the people are.. well... less classy? The guy was digging himself a hole.\n\nSo we order drinks, which seem to take about 10minutes to get to our table.  In the mean time we're looking at our menu and the waiter leaves again for about 10min... he finally shows up and we order from this tiny little menu.   My girlfriend and I order some tacos and chips with guacamole, everyone else orders something a bit similar.  \n\nConversation is picking up while we wait for our food.  I see people coming and going and that's when we notice that our food is taking too damn long.  Finally after eating our small plate of chips and guacamole our food arrives. Probably about 45min later.  Here's the best part....\n\nSo the food shows up and after waiting for 45minutes, we get these tiny little tacos that look like they are from the menu of a 2 year old.  That's right.. each of the three tacos are literally two bites at most each.  Everyone eats their dinner in about 5minutes max..  pathetic.\n\nAfter our tiny little dinner, we ask for our bills..The waiter doesn't think to bring all our bills at once, no.. instead he brings one or two at a time. Guess he wants us to stick around? Who knows.. Finally the two filmmakers get their bill, pay and they leave.. couple other of our friends do the same.  My friend and I stay with our other friend who's still waiting on his bill.  He gets it and notices that his $15 meal was just charged $30 on his credit card.  He complains and the waiter vanishes for about 20minutes to fix his card.  When he comes back he gives some crap about fixing it and giving him a credit.. guess how much? Oh about 50 cents.. \n\nHe signed the slip and the remaining three of us left this crappy place.\n\nThe place actually does look pretty cool.  Too bad the service sucks and the food is barely appetizer quality at best.", "type": "review", "business_id": "9YUe5J_cPCBo_mL7-z9HCQ"},
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3nUQ4xbLlySDbkE03nyp-Q", "review_id": "3mXO3UiaQCCFY4ZpG_E-tA", "stars": 2, "date": "2011-10-23", "text": "This review is about the Attendants (Ushers).\nHas a group they are totally unfamiliar with the seating plan.\n\n****They'll send you to ANOTHER door, for BEST ACCESS to your seats.\n****Guess what, you were previously at the BEST DOOR.\n\nI have a feeling, that these Folks, are volunteers.\n       MANAGEMENT should not put, unknowledgable staff, on the floor.", "type": "review", "business_id": "RA2EuX04SHqmayKpLhpNvA"},
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "y7sq26EXGz7XG7DSo8TOuQ", "review_id": "QrPdGSAlxTICOoNXKD7Wcw", "stars": 4, "date": "2010-11-11", "text": "Location: First off, my guest and I (we drove separately) had a little difficulty finding this place. I am not sure if this was because the sign was not lit up or what. But, they are just 2 weeks old and maybe that hasn't been done or something. Just we aware that the sign might not be lit up when you go.\n\nVenue: It is actually kind of neat inside. There didn't seem to be any \"prime tables\" as all the tables were pretty much just 4-tops. Also, not a lot of seclusion if you are looking for that. About 40% of the venue is a bar, but isn't separated from the restaurant. Real sleek, suave bar. The kitchen is open. So, if the cook is spitting in your food then you will probably see them. I kind of liked having the open kitchen in a small venue.\n\nFood: I had the Green Chili Stew with macaroni and cheese. Go ahead, laugh at my mac & cheese. The green chili was a touch spicy but then again, I am a total spice sissy. Even with that said, it *was* good. I ate it all. \n\nThe mac and cheese was a different story. I jokingly ordered that right off the bat and our server raved about it. Said he loved it. My guest also ordered it. Without a doubt, the mac and cheese was awesome. Really, I think it was better than my green chili stew.\n\nCost: It cost us $48 for two people. This was with 2 mains, 2 sides, an iced-tea, and an alcoholic beverage. Not bad.\n\nBottom Line: I see this place succeeding... especially if people can find it with their light off outside.", "type": "review", "business_id": "I4bSn5gXsHuSPu7L-d_8nQ"},
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8_KqOlVJo1D4_NUMWs2RBA", "review_id": "TJUBZv5b_jQAEAQf2zjoMg", "stars": 5, "date": "2013-06-18", "text": "I love Stereo Joe! I had bought a new radio thinking I could install it myself. That was a disaster. I went to Joe and it did it cheaply and quickly. He is also the nicest guy. I felt really good about supporting this small business. Joe is a great guy and very helpful.  When he installed my radio, he also fixed my broken car clicker at no extra charge. Wow.  I felt like he genuinely cared about helping me more than he cared about my money.", "type": "review", "business_id": "UkWSzVhcrnLHeVk_4wQDFg"},
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "xFFmQTr0srCsnXiupIXT2A", "review_id": "YUeMWkd7Foact1Bd_rmNkQ", "stars": 5, "date": "2012-10-24", "text": "Great food and atmosphere.  Plenty of TVs to watch the games.  Chef Patrick Fegan and his partners of TK Urban Tavern in Scottsdale Quarter just opened this great location.  Pumpkin Soup with pumpkin oil and croutons is such a great start to the Fall season.  Wood fired oven pumping out flatbreads.  Sweet Potato gnocchi made in house with roasted corn and gorgonzola crema is unbelievable.  \n\nVery impressive selection of beer handles and delicious cocktails.   Amazing view of the sunset as well.  Can't wait to return.", "type": "review", "business_id": "86fq6mtHmd6VL8GROG4vSQ"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zNjguoWpQ5vmHq0q5uvJGg", "review_id": "b8qXxdXo9NFQ79xQ565vwg", "stars": 4, "date": "2012-11-20", "text": "Ate there yesterday (11/19/12) and had a great lunch after getting confused, direction wise as to its location. It's a couple blocks West of town Junction of Hwy 93 and Hwy 60 in Wickenburg, AZ. I had the #11, three enchiladas: cheese, chicken and shredded beef. Excellent refried beans and rice, chips, two different kinds of salsa and bean dip. Service was super friendly and fast. I'll definitely be back next time I'm in the area!", "type": "review", "business_id": "x55m0oB4eVv6pCnxR_9K4g"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "goOcTbMYD-eD12YlsagPyg", "review_id": "D8ahA2oMZr5cHy75QTgt4w", "stars": 5, "date": "2011-02-26", "text": "This place is great! I love their mint chocolate chip yummmy! They have a bit size cup for 2.99 and it always gets loaded up love it!", "type": "review", "business_id": "tV97OH1LK00kUcX0Jig-sQ"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w6r1V9eOsGrebp2LbpcNzQ", "review_id": "-9VmcWlqMIlbGBhRnJdWZg", "stars": 2, "date": "2010-03-06", "text": "This was my first and last time here. I got the Vanilla Bourbon gelato. It was overpriced, and old. It was not creamy, but had started to turn icy. I will go to Enzo's or Angel Sweet instead. (Enzo's has awesome cannoli's)", "type": "review", "business_id": "r_0k2yqAo1Z4tg_IgXr7Jg"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pwCifXXtt2Mzt_CPLpUC2Q", "review_id": "DUlKGNKFCZwwEUTb77t6-w", "stars": 4, "date": "2012-02-20", "text": "One word: Authentic! I love Hue food and this place pretty much has it all. I tried their bánh bèo chén, bánh kht and bún bò. The bún bò would be perfect if there were some rau kinh gii to eat with. I thought the bánh bèo was very good and so was the bánh kht. They also make fresh Pate Chaud and bánh giò! Can't wait to come back to try the rest on the menu.", "type": "review", "business_id": "tpJjVxyor9OOQfYgvAtdRA"},
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "AOmdmYYSeLUstcN084_wMA", "review_id": "uOa3TdnSsyxBmtk-DLgMAw", "stars": 4, "date": "2012-03-31", "text": "This place is located in the hotel at the corner of Drinkwater and Indian School.  I can't remember the name, because it changes ownership ALL THE TIME.  \n\nFirst off, expect to spend lots of dough.  The portions, for the most part, are tappas sized, and you'll need to order at least two (at $10 a shot) depending on your appetite.  The flavors, though, are masterfully paired.  This place is definitely for foodies that appreciate chefs that actually COOK and CREATE.\n\nThe guacamole, again expensive, is probably the best I've ever had. It's not overpowering in spice, cilantro or anything...it's just fresh and mild and smooth and delightful.  I've heard if you check in on Yelp, that you get a guac for free, so look into that.\n\nA pitcher of top-shelf, hangover-free, margaritas will set you back $60, but the food begs for a tasty cocktail to toast with your friends.\n\nThe parking stinks - valet for the most part. Look for free, open parking to the west of the property, or park in old town near the Grapevine restaurant and take a 2 minute walk.", "type": "review", "business_id": "lKQ5hnkSQ-XP80jNCH46nQ"},
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EDyJnySlK3Zq1jJjUoRWJQ", "review_id": "PV_1hilY2cb0oi256ghXzA", "stars": 5, "date": "2013-10-03", "text": "This place is amazing. I come here at least once a month & am never disappointed. \n\nFood & service is always great. The buffalo burger it TDF as well as the bruschetta. \n\nOutside seating is so cute with a lights (great for date nights) live music inside is a wonderful touch. \n\nThis place is great to meet with friends, family or date night. It's truly a Scottsdale must.", "type": "review", "business_id": "s1dex3Z3QoqiK7V-zXUgAw"},
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "XrD_RUiFeKsQ63WL3l_crQ", "review_id": "KETr5UiBNvFX9xSxX5aHqw", "stars": 5, "date": "2010-10-04", "text": "I read about Scramble on line so I thought I would go there for brunch and I loved it!! The Santa Fe eggs Benedict are amazing! The staff is friendly and the ambiance is incredible. I would highly recommend this place to anyone!!!", "type": "review", "business_id": "XHr5mXFgobOHoxbPJxmYdg"},
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "cl1LMRfak6gR3vqsEzRtHQ", "review_id": "V82DIXQ5MVCYZu72QiOr-w", "stars": 4, "date": "2006-08-06", "text": "UPDATE: Ach du lieber! The other day, change came to town and made me cry. Drift no longer carries Sierra Nevada. An ugly, ugly thing, I know. At present, I'm not sure how to proceed. I suppose there's always the Fat Tire. You've been warned.\r\n\r\n========================\r\n\r\nDrift offers decent beer and wine selections in a pleasant atmosphere. Inside, the decor is a bit like being at Disneyland, but it works well. The food is interesting and enjoyable. Food and drinks can get pricey, but they have to pay for the atmosphere in one way or another. \r\n\r\nAs others before me have pointed out, the service at this place stinks more often than not. They also have a tendency to turn off the misting system on the patio and crank up the fire-spewing tiki torches too early, leaving you in a puddle of sweat during the hot months. They will turn them back on, though, with a request. \r\n\r\nDrift is looking to expand its patio into the parking lot and add a waterfall. The designs look pretty cool and seem to include cabana-like havens for more private enjoyment. The remodel seems to be in the Wynn Las Vegas vein (waterfalls, lighting, etc.).\r\n\r\nBottom line: If you have patience for poor service from cute girls, Drift offers plenty of enjoyment.", "type": "review", "business_id": "o4DsvwwD2kIbF-EM4r9G8A"},
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "6yQ3xyfor5TtX1POugtTag", "review_id": "gCbhfkYWx6k9kI2ReqUNjw", "stars": 5, "date": "2009-10-22", "text": "I Love LOVE this place- and while I currently live in Chicago next to the Baron of Japanese Markets- Mitsuwa, I love this place even more. Although it is not as large as Mitsuwa and doesnt have the same variety, service is spot on and the prepared foods are delicious!!\n\nI ended up buying a nigiri plate, and an unagi dish served on rice!", "type": "review", "business_id": "Kur7YGwuw6CqnqEypNrOvQ"},
{"votes": {"funny": 2, "useful": 7, "cool": 8}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "gdkfi-giaTU9kQGfwqml2w", "stars": 4, "date": "2008-10-25", "text": "Aside from the wait to order and the other wait to get your food, Defalco's rocks!  I was there for a late lunch on Friday and I opted to forgo my usual salad choice and go for the eggplant parm sandwich - yum!  Each bite of perfectly crusted eggplant had the most amazing tangy tomato sauce and melted cheese and it was oh so dlvine!  I had it on wheat bread and finished my entire sandwich (and yes, I ordered a full size!)  What a treat! \n\n Don't try to special order at Defalco's - Jared attempted to create his own sandwich and what he ended up with was nothing close to what he ordered.  \n\nI can't wait to go back to 'make my own pizza' - i know about that thanks to Max A!  I have a feeling that I'll be visiting Defalco's quite a bit since I'm now living in the area after a recent move.  It's a good thing - well, it's a tasty thing, maybe not so good for the waistline!", "type": "review", "business_id": "z3yFuLVrmH-3RJruPEMYKw"},
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TvtARzzT8bvPKLiLEeMIHw", "review_id": "KTNMLRjb7LTDcuW_IhBPDQ", "stars": 5, "date": "2013-10-11", "text": "I thought this Sweet Tomatoes was brand new when I walked it.  Very Clean and everyone was friendly and attentive.  The staff at this location are a class act!    The salad bar and it's topping were well maintained and fresh.  I especially liked their array of pasta salads.  The Tarragon and Tuna and the Asian Peanut were my favorites!  I am a soup lover and could spend my entire meal there alone.  I got a second ok a third helping of the Spicy Sausage with Pasta and beans.  Pizza was good as was the hot pasta selection.  I definitely plan on coming back here again and again...even though it's not the closest Sweet Tomatoes to me it is by far the best I've been to in the Valley...kudos!!!", "type": "review", "business_id": "5jazn-RZP2R6ZkCIPZsf0w"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "esomNneHvsEv91MmraM5ug", "review_id": "g8Mv_qpMY0VRFULzZWdsWg", "stars": 5, "date": "2010-02-08", "text": "Why is everyone else writing their reviews on the listing on Hanna?? Wrong address peeps!\nSo I had been wanting to eat here for a while, but everytime I come to Westgate it was to meet friends at one of the big restaurants there.\nSo I came here today on my own for lunch. It was pretty easy to figure out how to order (you pick a bag by number that corresponds to the category number on the menu then you choose your toppings)\nI got the Ruben with provolone and thousand island and I substituted the sauerkraut for  coleslaw and it came toasted. I also ordered the house chips which are homemade potato chips with salt and pepper.\nSo I got my sandwich and was surprised at how small it was. It was significantly smaller than the sandwich places I normally go to. So I ignored the size and dove in. WOW! The bread was so good. Toasted without being dry, light. The meat was perfectly cooked, not chewy like the last sandwich I ordered at another place, the coleslaw was so good and flavorful, juicy without dripping all over the place. The chips were also really good! Now the sandwich was smaller than I am used to but it wound up being the perfect size. It was so good I can't wait to go back!", "type": "review", "business_id": "yA9gOueRPoQ4-Y8Xdu8k3Q"},
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_tH9ttWZNQjr7KaUVp2fXQ", "review_id": "skSINztqPKM-T_1JxOhGVA", "stars": 2, "date": "2010-05-09", "text": "great bar.... not great food.  ****but it's cheap****  this is a great location and really cool atmosphere. just don't go in expecting very good food. I would suggest grabbing some chipotle beforehand, then going in for some wings and beer. I had the chicken enchiladas. they took the enchiladas and put some chunks of chicken on top... making it obvious that the cheese filled enchiladas were just heated. I guess not too bad for 9 dollars. i was suprised that rice and beans was extra. The chips were pretty good but the salsa was just chunky processed blah.  my best guess is that the kitchen simply a line of fridges and microwaves. definitely stop for a drink however. total bill with tip for two people including 2 drinks each was under 35 bucks.", "type": "review", "business_id": "hkKvb6oXxn8ygoP5fFln1g"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kqvfep2mxS10S50FbVDi4Q", "review_id": "WF-MyenfDFfgO2OvvM3f_Q", "stars": 3, "date": "2010-06-13", "text": "Stopped in here for lunch the other day.  I ordered the Marzen barbecue chicken sandwich with garlic fries.  The sauce on the sandwich was good but the chicken breast was pretty tasteless.  The garlic fries were a winner!\n\nService at the bar was fast and friendly.  It was nice to have a TV to watch as I ate lunch.", "type": "review", "business_id": "TzImzfIWkZTnetKl2a4-SQ"},
{"votes": {"funny": 0, "useful": 6, "cool": 3}, "user_id": "MwJVSTsUB-htphNZaIC43g", "review_id": "j4APoHZFTytwOjGsFwXyTQ", "stars": 4, "date": "2008-03-22", "text": "I was watching the news this morning and they were doing a segment on the downtown market. I hand't been since last fall and being that I live insanely close, I knew I was slackin and needed to head over there. So we rode our bikes down and I was SO glad I went!\n\nNot only has it gotten bigger, it truly has gotten better. Not only, do I just love seeing in people in downtown Phoenix...you could really see how excited the vendors (and customers) were to see people in downtown Phoenix. \n\nThe optimist in me is consistently hopeful that people will build on the grassroots, artsy, local vibe that is quietly emerging in downtown Phoenix. And subsequently help this crazy state have a bastion of independent and locally owned goodness!\n\nIn terms of what I like best there...there is a woman who makes pasta out of veggies...with low amounts of starch. I've had a couple different flavors and it is truly amazing. She has these little signs everywhere and it's completely true -- You don't need sauce! Just a little oil! \n\nThere is an older man who sells greek baked goods. He is my favorite person to chat with at the market. And his baklava is good stuff.\n\nDr. Hummus has outstanding artichoke hummus and tapanade. Her chips are pretty delicious as well.\n\nHelp downtown Phoenix come alive and buy local!! \n\np.s. I saw that they are opening a downtown public market grocery store on Pierce. Nice.\n\np.s.s. I agree with the post from Alexander...Tammie Coe, Willo, where are you!?", "type": "review", "business_id": "b3MaC7nWia6uYvJrP8iu1w"},
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rYGZwz6OV09vZ7YzqrZ-HA", "review_id": "c5S8F9s-V4w2BGrudgVPsQ", "stars": 2, "date": "2009-08-03", "text": "Compared to the last two Marriott's we were at this week... not good. I will say, for the record, that they were great when we got a gross room (switched us immediately), and were great about waving the dog fee, since we weren't told there was one and will only be here for one night... but this hotel is outdated and badddddd.", "type": "review", "business_id": "7ntQeXCgfRU0GazrP5TG9A"},
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "1_na8oNG_KqK622DDyRwtw", "review_id": "J8_lcJU-Fmebtl-1WHOTTQ", "stars": 5, "date": "2013-05-13", "text": "My boyfriend and I decided to take his son out for gelato yesterday, and after seeing the reviews on this place, we decided to try it. I purchased the fantastic deal available and off we went. Once we arrived, the person we dealt with was super personable and very helpful; she let us try all the flavors we wanted to make sure we would get the one we liked. After trying the African Dark Chocolate, I knew I'd found my new love. It was absolutely delicious! My boyfriend and his son are also huge fans. We will definitely be back! If you haven't checked this place out yet, you should definitely fix that. :)", "type": "review", "business_id": "84NQRcMC0ldIC86yRw0vpA"},
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DvD2kL3UiPM7iDQ5BC9ViQ", "review_id": "IumP6ugbepbFu6qv3Cw47g", "stars": 5, "date": "2011-08-25", "text": "I can honestly say this is the most I've laughed at a dinner theatre! The cast is witty and very funny! I have seen two of their shows now and always wish I had invited more friends. I'm so glad they have started shows on the west side too! \n\nMy only discretion, if you're looking for a normal, conservative show, this may not be your best choice. It's more out of the box and the interactive but that's what I love about it!", "type": "review", "business_id": "uAvR3w-VQiplcDjz-LJvgg"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5UJ0tdHGPJGL3lBLEAerRw", "review_id": "zVafyP7Qoyab5jH2ziAe0A", "stars": 4, "date": "2013-10-04", "text": "A very kid friendly place to have a BBQ meal. You order your food as if you were in a cafeteria setting. You grab a tray, grab your drinks, and go up to the counter to order your meal. Then you push your tray along and grab your sides. Once you got everything and paid for your meal you find a seat inside or head outside (if it's not too hot) to sit at a park bench. You eat for free on your birthday so be sure to bring something to verify your birthday. We even had the opportunity to be greeted by Joe himself as he made his way from table to table asking how things were and to thank you for coming to visit. I thought that was very classy. We will be back once we are in the mood for more BBQ. \n\n\nVisited April 2012", "type": "review", "business_id": "5VMajxduxfLPSyQkVFKESg"},
{"votes": {"funny": 6, "useful": 7, "cool": 7}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "ayrzyocEM7AtVdc6xE2Paw", "stars": 3, "date": "2009-03-18", "text": "I've never really had any problems/issues coming to this Best Buy and I will admit that my rating is largely due to the Geek Squad, whom I positively adore (geeks are the new \"bad boys\" :swoon:). \n\nA couple of weeks ago my laptop suffered severe trauma and the DVD tray and hard drive became victimized by this incident, to the point that the computer was inoperable. Fortunately, it was under an extended warranty and the repairs were covered. The Geek Squad was courteous in assessing the damage and getting the computer shipped out for repairs, plus informed me about ordering a recovery disc from Sony. \n\nWhen I went to pick up the computer, the staff were thorough about verifying my identity and validity of picking up the computer (the service contract is in Robert M's name). Since I work in a bank, I appreciate this effort as I wouldn't want someone else walking off with my lifeline. \n\nMy only complaint is, we were told the hard drive would be returned with the repaired laptop so we could have a friend try to salvage any information (it was going to cost $250-1,700 if they did it). Unfortunately, we must have signed something indicating that any components removed from the computer would become the property of the service site. Ho hum! I already knew I'd have to rediscover all my porn, now my music and photos are gone, too. I suppose this is a lesson in backing up one's computer and data. And a lesson to put the computer on a stable surface when doing some supersonic idiotic disconnected not respected rap and dance number from an 80s classic teen movie. I can live with this.", "type": "review", "business_id": "kEqcAtMaC6hcY8Wbi1nxtA"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "kiXR40xr9y4RN1_pMKa5IQ", "stars": 3, "date": "2013-10-23", "text": "You can eat and drink as Irish as you please -or not, here.  A diverse menu, fresh, tasty food, good service.  A classy bar, a great place for St. Paddy's day or Cinco de Mayo.", "type": "review", "business_id": "-gefwOTDqW9HWGDvWBPSMQ"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zdPRXhhJNCiCOgWQwoPlpg", "review_id": "9aIyhnADh4aKpT3fmhFitw", "stars": 4, "date": "2013-08-19", "text": "What a unique experience for kids, not so much boys so thankfully I got a girl to share this with. Brand new state of the art facility, so I'm assuming thats what your paying for at the ticket counter. A bit pricey if you ask me but the gift shop was actually reasonable so thats a wash in my book.....\n\nWe were just in time to catch a 3D documentary on the flight & life of a monarch butterfly. I've seen this before on the tele but it was pretty cool in 3D. Then from there we went into this staging room before the atrium were we got to see several different types of butterflies emerging from their cocoons. Pretty cool! This place is great because there is no rush, it's all at your own speed. After watching butterflies break out of their cocoons we were off to the atrium. a butterfly haven. NO TOUCHING, NO PICKING UP but if they land on you thats ok. Hard for a little girl to grasp so I had to keep reminding her. Trust me when I say the butterfly keepers are on it too! The only thing I don't like about this experience is Summer, it was nice and toasty in there and the humidity was off the charts. From there tho you can cool down in the snack shop before you continue on.....\n\nThe next area is about insects & fish. Really good displays of both & a shallow tank with sting rays in them for petting. Not as spectacle as sea world but worth saving yourself a 5 hour drive over. You make your way thru the gift shop and after that your at the entrance/exit, round 2-sure, there's no time limit, how great! \n\nMy recommendations is try enjoying this place in better weather, you'll get your monies worth for sure being able to stay longer. Thank you who ever put this together, a great thing to have here in the valley. I will refer like mad!", "type": "review", "business_id": "cHmmow7f9giYMfQ4bp7JHw"},
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WDcCV1BRQ9jlxMNL2zjMbw", "review_id": "6g8R8-3dKuAZ6C5feQoeeQ", "stars": 5, "date": "2011-08-17", "text": "As a local boy from Hawaii I made it a quest to find a place that reminds me of home and after living in Phoenix 4 yrs now.....I finally found a place that can subdue my craving for a for Korean style plate lunch. Plate lunch is a term that us locals like to call our plates from a bbq or local eatery. A normal plate that you can get from ONO Hawaiian BBQ, L&L BBQ, or any other hawaiian places is that every entree comes with rice and mac salad. But Korean style plate lunches come with rice and 4 sides like mac salad, kimchee, cucumber kimchee, noodles, corn, salad, and seaweed plus a few other choices. Thas the key difference and so far this is the only place I have found this.\n\nI like this place the most compared to any other Hawaiian bbq spot out here is that they serve Meat jun and the sides.  Meat Jun is thinly sliced marinated beef that is egg battered, then pan fried, and served with a slightly spicy sauce. It is also a Korean entree that originated from Hawaii so don't really expect to find this at any other Korean restaurants.\n\nI recommend people to try this place.", "type": "review", "business_id": "i_H_yKtISROjQ4eruSwyPw"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WozD8e087LDylHUqoMaeig", "review_id": "WFovWfst7GsbH6W_PBRD1Q", "stars": 4, "date": "2011-06-18", "text": "Um, YUM! We got the garden salad - very fresh. We also got the pizza with avocado, olives, etc. VERY good. The dough is soooo yummy and you can tell they just made it. The toppings were perfect. EAT HERE.", "type": "review", "business_id": "vN4mFODLd-gLmDg261wsyw"},
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JPwN2CgjNap0mkIvXx9vOg", "review_id": "uez301rxUF4KETJLSvz_wQ", "stars": 3, "date": "2011-02-23", "text": "Very nice place, new and clean. Food is just OK. Typical Chinese buffet food, nothing new. Price is fair.  Sushi doesn't look like sushi at all.", "type": "review", "business_id": "Aa-UgGOs1lDZzQhap370Ig"},
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RtuX0lzQ_IGBTFRurnLsBg", "review_id": "V2XvyTRy_K5SwXP64lhtuw", "stars": 5, "date": "2012-05-10", "text": "Ever been somewhere and had service that just made your morning?  A Chinese couple sat down at the booth next to me.  The server came up with their food, delivered it, and then softly asked, \"um, how do you say 'thank you' in your language?\" They told him (it's 'xie xie' though my spelling is probably off), and he smiled, bowed, and said \"xie xie.\"\n\nHis manners, his approach, and his openness were like a warm hug. He could have been brisk and to the point, he could have just said \"thank you.\" He could even have been surly. He chose to take 20 seconds and reach out to a total stranger. \n\nI'm not saying this makes CB the best place ever. But it sure gave me a smile at the start of a long day, and I am very grateful. In my ancestral language, \"tusen tak.\"", "type": "review", "business_id": "di2QHs2SrY0XFHcfAq_k2A"},
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "6G8vLJUi1Ees2qC3RGA3Nw", "review_id": "bTq1WHEbzLn-NKyxr4Qldg", "stars": 3, "date": "2012-11-21", "text": "Went here on opening day - didn't know if they'd be open yet or not, but the wife had a craving so we decided to check. Front door was wide open. Nice little place - got seated immediately and attended to by a fairly nice waitress. Imagine my surprise when I checked the menu and saw Vietnamese pho! I'm a big fan, and while I was guessing it wouldn't be up to par with more centrally-located places like Pho Thanh I decided to give it a shot. The wife had massaman curry which she asked to be made quite spicy (\"Thai Hot\" as they call it). My pho, as predicted, wasn't that great. The meat was cut into thick chunks and the broth was actually sweet! I called one of the servers over and asked about it - they said that the cook was used to Thai dishes and had put a little too much sugar in as that's the norm with other stuff like the satay sauce etc. Fair enough, like I said I was expecting it. Taste aside, it wasn't a huge bowl and it was $10 - very much overpriced. I honestly don't know why I got it at a Thai restaurant, I suppose it's just because I like it so much that when I saw it on the menu my eyes glazed over. Like getting a burger at a Dairy Queen or something? (shrug) Anyways, the wife thoroughly enjoyed her curry - quite spicy but not too spicy for her. Note that she was charged an extra $1 for brown rice - a little too nickel-and-dimey for my liking. My kid had his usual chicken satay sticks. The chicken was dry and leathery, so marks dropped for that. Decor was nice, menu was done very well (see my photo).\n\nAll in all a fairly average experience. We'll be back to check out other dishes (Thai ones! *8-) and to support this new local business, but these folk certainly have a lot of catching up to do before they draw level with Line Thai in Sun City and (so far) wouldn't be our first choice for lunch or dinner going forward if we were starving.", "type": "review", "business_id": "_K5cfCM7-zQZ1hXdbsc2fQ"},
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "Dv2aK0Me2o8c6jr2WZb5Mg", "stars": 2, "date": "2008-05-01", "text": "I try to never eat here.  The food is bland and overpriced.", "type": "review", "business_id": "KHgRmDcFxi8neGVUWlZ2mA"},
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "6EIFOE5S7mJUQbxZaP7Xxg", "review_id": "qrnnDR_s3RqJQXFLUrHNpg", "stars": 2, "date": "2013-02-02", "text": "We just moved to gold Canyon a few months ago and are year round residents. We frequent the many small businesses in the area.  My wife and I had dinner there for the first time today.  First the service was not great, our server, Missy was inattentive and really put out the vibe that she hates her job.  The menus smelled like stale beer. We ordered the sage pizza and wings.  The pizza was edible but not great, reminded me of frozen pizza the center crust was very thin and soggy.  The wings were good, we had the MO wings.  To be honest, we probably won't be frequenting this restaurant again.  Which is unfortunate in trying to support the local businesses. Change the crust of the pizza and add more sauce and cheese, and employ better wait staff. Then maybe I'll be back.", "type": "review", "business_id": "2NnES_12fMqudH3L5bdrSA"},
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TJRBA15ziLkf5chQrCrzHA", "review_id": "YSETxI4KpNkbU6uTF6tlxw", "stars": 3, "date": "2013-11-04", "text": "This was my first trip to this brand and it was very pleasent.  The staff was friendly and greeted me warmly as soon as I walked in.  I ordered two of their limited time subs and was back out the door quickly.  \n\nThe food was good but I was a little disapointed with the size for the price.  I'm sure I'll go again as it did taste good.", "type": "review", "business_id": "TxxhWPMILH40JlZbX7KNHA"},
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "rPGZttaVjRoVi3GYbs62cg", "review_id": "xVt7R-T_317Xi8WUCbgUsQ", "stars": 4, "date": "2008-06-13", "text": "Dear Weather & Coffee,\n\nI'm really sorry you had to close.  We had a lot of good times together.  Every time I came in, you always seemed really happy to see me... even though you knew me by the wrong name.  \n\nI may be Kelly to everyone else, but I'll always be Aubrey to you.", "type": "review", "business_id": "QQ-lSbz4ARm1MQA5z8-nAw"},
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xtE_rVyiyfZWWBojkcme7A", "review_id": "YOPFtEpe8pPzOeuAcJEkNA", "stars": 4, "date": "2012-06-02", "text": "The best Chinese food in northern Phoenix, and maybe in the entire metro area.  Heck, my wife and I have sampled the Chinese cultural district as well, and in our opinion, the Nee House betters all restaurants there as well.  \n\nThe Nee House has the best General Tso's chicken in the region, with a little twist (I think it's ginger, but i'm not certain) that sets it apart form its competition.  The General Tso's rivals its competition from the west coast and east coast.  The noodles are fantastic, with fresh ingredients and vegetables, and the eggplant and salt-n-pepper shrimp are outstanding.\n\nThe only reason i didn't give The Nee House 5 stars (and I admit, I'm being picky) is because they do not have a dish I've been looking for in the entire Phoenix metro-area, but admittedly the Nee House does not  focus on Sichuan-style dishes (the dish i'm looking for is Sichuan Spicy Cold Chicken Noodles, which i fell in love with while living in the Bay area, but which is impossible to find in the Phoenix-metro area).\n\nIf you want authentic, delicious, Chinese food, make sure you give the Nee House a try.", "type": "review", "business_id": "ChmqODwuYP1ewjmWXtxtsg"},
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VU2c835liKaSfE5Wl9Vj8A", "review_id": "v8k02wS7dkb6hGdovG8r9w", "stars": 5, "date": "2012-12-21", "text": "For the past year and a half, I've had Whitey's service my car whenever something wasn't under the Infiniti warrantee.  And I'm nearly giddy that my warrantee is up, so that I can have only JP's eyes and hands on my precious car.\n\nWhitey's has fit me in whether I was calling the day before or two weeks prior.  This isn't for a lack of business (actually, the place nearly always seems super busy), but because they genuinely want to make their customers happy.\n\nI trust that I'm getting honest opinions, thorough work, and a fair price.  Each time, JP explains what work he did, what work will need to be performed in the near/distant future, and the pricing for it all so that I can be prepared for what I'll spend (and avoid finance-induced heart complications).\n\nCertainly I could go into greater detail about my various experiences at Whitey's, but there's no point when they've all be stellar.  Bottom line?  They're awesome in all the ways that matter, and even some that don't.", "type": "review", "business_id": "tenKOmTRi2rjZAWwNCDv6w"}]